{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"content_width":"80ch"}},"faq_xJmbjE":{"type":"faq","blocks":{"item_ezctnQ":{"type":"item","settings":{"title":"What shipping methods are available?","content":"<p>We use a variety of shipping methods, including USPS, FedEx, UPS, and Amazon, to ensure that customers receive their products as quickly as possible.<\/p>"}},"item_PCM74q":{"type":"item","settings":{"title":"Do you ship internationally?","content":"<p>We primarily ship within the 48 contiguous United States and do not cover Alaska, Hawaii, APO\/FPO addresses, US Protectorates, or international locations through our standard services. If you're outside these areas, please send us a private message. We'll be happy to provide a special invoice including shipping and pricing for your location.<\/p>"}},"item_fKXVt4":{"type":"item","settings":{"title":"Do I need to pay for shipping?","content":"<p>No, we cover the shipping costs to provide you with the best shopping experience. However, we also offer other shipping methods that you can choose based on your needs.<\/p>"}},"item_8t8DM7":{"type":"item","settings":{"title":"How long will it take to get my package?","content":"<p>Typically, you will receive your order within 2-7 business days.<\/p>"}},"item_wrYKRB":{"type":"item","settings":{"title":"How can I track my purchase?","content":"<p>After placing your order, you will receive a tracking number. We will email you any updates on your delivery information. You can also track your order by logging into the \"Track My Order\" page on our website and entering your tracking number.<\/p>"}},"item_qgYaNR":{"type":"item","settings":{"title":"Tracking is not showing any movement, why is that?","content":"<p>Sometimes, due to high demand and other logistical issues, there might be delays in tracking updates. Rest assured, our shipping carriers are working to resolve any tracking issues and delivery delays.<\/p>"}},"item_crrELJ":{"type":"item","settings":{"title":"Why haven't I received the tracking number after many days?","content":"<p>Occasionally, due to stock shortages or other factors, there might be delays in shipment and tracking updates. If this happens, please contact us, and we will assist you promptly.<\/p>"}},"item_Jc4HR9":{"type":"item","settings":{"title":"Can you ship to a PO Box?","content":"<p>We only deliver to verified physical addresses and do not deliver to PO Boxes.<\/p>"}},"item_KiaEff":{"type":"item","settings":{"title":"What types of loading and transportation accessories do you offer?","content":"<p>We offer a variety of loading and transportation accessories, including truck bed racks, roof racks, roof platform, mud flaps, running boards and more.<\/p>"}},"item_4K8Ftm":{"type":"item","settings":{"title":"Which vehicle models are your products compatible with?","content":"<p>Our products are compatible with a wide range of vehicle models, including Toyota Tacoma, Ford F150, Chevrolet Colorado, JEEP Gladiator, and many others. Each product page lists the specific compatible models.<\/p>"}},"item_GEy3pw":{"type":"item","settings":{"title":"What materials are your racks and roll bars made from?","content":"<p>Most of our racks and roll bars are primarily made from high-strength metal with a durable powder-coated finish to ensure longevity and corrosion resistance.<\/p>"}},"item_BUnWTj":{"type":"item","settings":{"title":"How do I place an order?","content":"<p>You can place an order by visiting our website, choosing the desired model and quantity, adding the items to your cart, and proceeding to checkout. Additionally, for your convenience, you can also order through Amazon by clicking the designated button on our site. This offers you an alternative way to purchase our products quickly and securely.<\/p>"}},"item_wgMz8g":{"type":"item","settings":{"title":"What payment methods do you accept?","content":"<p>We accept various payment methods, including credit cards (Visa, MasterCard, American Express, JCB) and PayPal. The credit card companies listed above are the most commonly used credit cards on this website. Do not worry if your credit card company is not listed, we encourage you to go ahead and make the purchase.<\/p>"}},"item_XYtR3h":{"type":"item","settings":{"title":"Can I cancel or modify my order?","content":"<p>If you need to cancel or modify your order, please contact our customer service team as soon as possible. We will do our best to accommodate your request before the order is shipped.<\/p>"}},"item_memWMx":{"type":"item","settings":{"title":"What should I do if the payment fails?","content":"<p>Since the credit card provider has a risk control system, your payment may be considered risky. When the payment fails, please immediately check whether your payment account is debited normally. If the deduction occurs, please contact us for further help. If there is no charge, please try again.<br\/>Additionally, for your convenience, you can also order through Amazon by clicking the designated button on our site. This offers you an alternative way to purchase our products quickly and securely.<\/p>"}},"item_MYbPDc":{"type":"item","settings":{"title":"Do I need an account to place an order?","content":"<p>You don't need an account to place an order, but we recommend you sign up, because then you don't need to enter your address again when you place an order next time.<\/p>"}},"item_FcFEwC":{"type":"item","settings":{"title":"How do I return or exchange a product?","content":"<p>If you are not satisfied with your purchase, you can contact us within 30 days to initiate a return or exchange. Products must be in their original condition and packaging, and return shipping costs are the buyer’s responsibility.<\/p>"}},"item_becXPz":{"type":"item","settings":{"title":"Who covers the return shipping costs?","content":"<p>Unless the product is defective or we sent the wrong item, return shipping costs are the responsibility of the buyer.<\/p>"}},"item_bXfGzG":{"type":"item","settings":{"title":"How long does it take to process a refund?","content":"<p>Refunds are processed within 48 hours after we receive and inspect the returned item. The exact time for the refund to appear in your account depends on your payment method and bank processing times.<\/p>"}},"item_ambJhW":{"type":"item","settings":{"title":"What if my item\/package arrives damaged?","content":"<p>When you receive your item, please check your item carefully. If the package appears damaged, please complete the following steps:<br\/>Take a picture of the damage. Then please email us at support@trumgeta.com immediately and attach the photos.<br\/><br\/>Please remember to describe to us what happened. Please include your name, order number, purchase item and order time. It's very important to us.<br\/><br\/>We will contact you directly with the next steps.<br\/><br\/>DO NOT throw away the boxes or packaging materials, otherwise, your claim will not be honored by the shipping company.<\/p>"}},"item_Mhibx3":{"type":"item","settings":{"title":"What is the warranty on my purchase?","content":"<p>You have 30 days to return an item to us in its original condition. Any modifications or alterations to the product will void the original warranty. We are not directly liable for any loss, theft, or damages, during delivery. Please be patient as we have to claim the damage with the shipping courier and send you the parts or replacement.<\/p>"}},"item_qkX63a":{"type":"item","settings":{"title":"How do I install the items?","content":"<p>Each product comes with detailed installation instructions and the necessary hardware. You can also visit our website to view installation videos.<\/p>"}},"item_LTVY7L":{"type":"item","settings":{"title":"Do I need special tools or skills to install?","content":"<p>Most products can be installed with basic tools and do not require special skills. Just follow the instructions provided.<\/p>"}},"item_fGUTRb":{"type":"item","settings":{"title":"Do you offer installation services?","content":"<p>Currently, we do not offer direct installation services but can recommend professional installers in your area.<\/p>"}},"item_8PHDjR":{"type":"item","settings":{"title":"How can I contact your customer service team?","content":"<p>You can reach our customer service team via email (support@trumgeta.com), or online chat.<\/p>"}},"item_V6HeUT":{"type":"item","settings":{"title":"What are your customer service hours?","content":"<p>Our customer service team is available from 9pm - 6am UTC-5 every weekday.<\/p>"}}},"block_order":["item_ezctnQ","item_PCM74q","item_fKXVt4","item_8t8DM7","item_wrYKRB","item_qgYaNR","item_crrELJ","item_Jc4HR9","item_KiaEff","item_4K8Ftm","item_GEy3pw","item_BUnWTj","item_wgMz8g","item_XYtR3h","item_memWMx","item_MYbPDc","item_FcFEwC","item_becXPz","item_bXfGzG","item_ambJhW","item_Mhibx3","item_qkX63a","item_LTVY7L","item_fGUTRb","item_8PHDjR","item_V6HeUT"],"settings":{"full_width":true,"subheading":"","title":"FAQs","content":"<p>Here, you can find information on key topics. We aim to make your experience as smooth as possible. <\/p>","team_avatar":"shopify:\/\/shop_images\/c926923bf65b8e9feb4c55bc6b1da806.png","team_avatar_width":160,"support_hours":"Our customer support is available Monday to Friday: 9pm - 6am UTC-5","answer_time":"Average answer time: 24h","button_text":"","button_url":"","text_position":"center","background":"","background_gradient":"","text_color":"","heading_color":"","heading_gradient":"","button_background":"","button_text_color":"","accordion_background":"","accordion_text_color":""}},"contact_b7ghYw":{"type":"contact","settings":{"full_width":true,"subheading":"Contact Us","title":"Still have a question?","content":"","text_position":"start","contact_form_size":"large","background":"","background_gradient":"","text_color":"","heading_color":"","heading_gradient":"","contact_background":"","contact_text_color":"","button_background":"","button_text_color":""}}},"order":["main","faq_xJmbjE","contact_b7ghYw"]}